Makr91/zoneweaver-agent/packaging/omnios/man/zoneweaver-agent.8
.Dd $Mdocdate$
.Dt ZONEWEAVER-AGENT 8
.Os
.Sh NAME
.Nm zoneweaver-agent
.Nd zone hypervisor management backend API server
.Sh SYNOPSIS
.Nm
.Op Fl -help
.Op Fl -version
.Sh DESCRIPTION
The
.Nm
utility provides a RESTful API backend for managing Bhyve virtual machines
and zones on OmniOS systems. It serves as the backend component of the
Zoneweaver Agent zone hypervisor management platform.
.Pp
.Nm
is a Node.js Express application that provides comprehensive zone and virtual
machine management capabilities including:
.Bl -bullet -offset indent
.It
Zone lifecycle management (create, start, stop, destroy)
.It
System resource monitoring and statistics
.It
VNC console access through WebSocket connections
.It
Network interface and VLAN management
.It
Storage pool and dataset operations
.It
Package management and system updates
.It
Terminal access via web-based SSH sessions
.El
.Pp
The service uses API key authentication for secure access and supports both
HTTP and HTTPS protocols with automatic SSL certificate generation.
.Sh CONFIGURATION
.Nm
reads its configuration from
.Pa /etc/zoneweaver-agent/config.yaml
by default. The configuration file uses YAML format and controls all aspects
of the service including network ports, SSL settings, database configuration,
and zone management parameters.
.Pp
See
.Xr zoneweaver-agent.yaml 5
for detailed configuration file format documentation.
.Sh SERVICE MANAGEMENT
The
.Nm
service is managed through the Service Management Facility (SMF). Use the
following commands to control the service:
.Pp
.Dl # svcadm enable zoneweaver-agent
.Dl # svcadm disable zoneweaver-agent
.Dl # svcadm restart zoneweaver-agent
.Pp
Check service status:
.Pp
.Dl # svcs zoneweaver-agent
.Sh API ENDPOINTS
The service provides REST API endpoints for zone management operations.
When API documentation is enabled in configuration, interactive documentation
is available at:
.Pp
.Dl https://localhost:5001/api-docs
.Pp
Key API endpoint categories include:
.Bl -tag -width ".Pa /monitoring"
.It Pa /machines
Machine (zone) lifecycle and configuration management
.It Pa /tasks
Asynchronous task queue for machine and system operations
.It Pa /monitoring
Host system information and statistics
.It Pa /network
Network interface and VLAN operations
.It Pa /storage
ZFS pool and dataset management
.It Pa /system
System management (packages, updates, users, logs, host power)
.It Pa /vnc , Pa /zlogin , Pa /ssh , Pa /terminal
Console session endpoints (VNC, zlogin, SSH, host terminal)
.El
.Sh AUTHENTICATION
API access requires authentication using API keys. The service supports
bootstrap initialization for generating the first API key:
.Pp
.Dl # curl -X POST http://localhost:5000/api-keys/bootstrap
.Pp
This endpoint is automatically disabled after the first successful use when
.Cm bootstrap_auto_disable
is enabled in configuration.
.Sh FILES
.Bl -tag -width ".Pa /var/lib/zoneweaver-agent/database/"
.It Pa /etc/zoneweaver-agent/config.yaml
Main configuration file
.It Pa /etc/zoneweaver-agent/ssl/
SSL certificate directory (auto-generated if enabled)
.It Pa /var/lib/zoneweaver-agent/database/
SQLite database directory
.It Pa /var/log/zoneweaver-agent/
Service log directory
.It Pa /opt/zoneweaver-agent/
Installation directory
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Start the service manually for testing:
.Bd -literal -offset indent
# cd /opt/zoneweaver-agent
# node index.js
.Ed
.Pp
Check API server connectivity (public identity/capabilities endpoint):
.Bd -literal -offset indent
# curl -k https://localhost:5001/status
.Ed
.Pp
Generate initial API key:
.Bd -literal -offset indent
# curl -X POST http://localhost:5000/api-keys/bootstrap
.Ed
.Sh DIAGNOSTICS
The service logs operational information to standard output when run manually,
or to SMF service logs when running under SMF management.
.Pp
Common diagnostic steps:
.Bl -enum -offset indent
.It
Check SMF service status: 
.Cm svcs -xv zoneweaver-agent
.It
Review service logs: 
.Cm svcs -L zoneweaver-agent
.It
Verify configuration syntax: 
.Cm node -c /opt/zoneweaver-agent/index.js
.It
Test network connectivity to configured ports
.It
Verify database permissions and disk space
.El
.Sh SEE ALSO
.Xr zoneweaver-agent.yaml 5 ,
.Xr svcadm 8 ,
.Xr svcs 1 ,
.Xr zonecfg 8 ,
.Xr zoneadm 8 ,
.Xr bhyve 8
.Sh STANDARDS
The API follows REST architectural principles and returns JSON-formatted
responses. Authentication uses industry-standard API key mechanisms with
bcrypt hashing for secure storage.
.Sh HISTORY
.Nm
first appeared in Zoneweaver 0.0.1 as part of the OmniOS zone hypervisor
.\" x-release-please-version
management platform.
.Sh AUTHORS
.An ZoneweaverProject
.Sh SECURITY
.Nm
implements several security measures:
.Bl -bullet -offset indent
.It
API key authentication with bcrypt hashing
.It
CORS origin validation with configurable whitelist
.It
SSL/TLS encryption with automatic certificate generation
.It
VNC console sessions bound to localhost for security
.It
Configurable session timeouts and concurrent connection limits
.El
.Pp
For production deployments, ensure:
.Bl -bullet -offset indent
.It
Strong API keys are generated and securely stored
.It
CORS whitelist is properly configured for frontend origins
.It
SSL certificates are properly configured or auto-generation is enabled
.It
Network access is appropriately restricted via firewall rules
.It
Database files have proper filesystem permissions
.El
